Community-PIO-CH32V/platform-ch32v/misc/svd/CH32M103xx.svd
      </registers>
	</peripheral>
	<peripheral>
      <name>USBPD</name>
      <description>USBPD control register</description>
      <groupName>USBPD</groupName>
      <baseAddress>0x40027000</baseAddress>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>USBPD_WKUP</name>
        <description>USBPD wake-up interrupt</description>
        <value>67</value>
      </interrupt>
      <interrupt>
        <name>USBPD</name>
        <description>USBPD global interrupt</description>
        <value>65</value>
      </interrupt>
	  <registers>
        <register>
          <name>R16_CONFIG</name>
          <displayName>R16_CONFIG</displayName>
          <description>PD configuration register</description>
          <addressOffset>0x00</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <resetValue>0x0002</resetValue>
          <fields>
            <field>
              <name>IE_TX_END</name>
              <description>end of send interrupt enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IE_RX_RESET</name>
              <description>receive reset interrupt enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IE_RX_ACT</name>
              <description>receive finished interrupt enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IE_RX_BYTE</name>
              <description>receive byte interrupt enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>			
            <field>
              <name>IE_RX_BIT</name>
              <description>receive bit interrupt enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IE_PD_IO</name>
              <description>PD port interrupt enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTX_BIT0</name>
              <description>Send and receive the current value of shift register bit0</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MULTI_0</name>
              <description>Receive a continuous multi-digit0 indication signal</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAKE_POLAR</name>
              <description>wake-up level</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PD_RST_EN</name>
              <description>reset enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>			
            <field>
              <name>PD_DMA_EN</name>
              <description>PD_DMA enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC_SEL</name>
              <description>communication port selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>			
            <field>
              <name>PD_ALL_CLR</name>
              <description>clear all interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>			
	       </fields>
		</register>
        <register>
          <name>R16_BMC_CLK_CNT</name>
          <displayName>R16_BMC_CLK_CNT</displayName>
          <description>BMC sample clock counter</description>
          <addressOffset>0x02</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>BMC_CLK_CNT</name>
              <description>BMC sent/receive sample clock counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
	       </fields>
		</register>
        <register>
          <name>R8_CONTROL</name>
          <displayName>R8_CONTROL</displayName>
          <description>sent/receive enable register</description>
          <addressOffset>0x04</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>RX_ST_H</name>
              <description>receive status high bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RX_ST_L</name>
              <description>receive status low bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DATA_FLAG</name>
              <description>data cache valid flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BMC_START</name>
              <description>BMC send a start signal</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PD_TX_EN</name>
              <description>sent/receive enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
	       </fields>
		</register>
        <register>
          <name>R8_TX_SEL</name>
          <displayName>R8_TX_SEL</displayName>
          <description>PD send sop selection register</description>
          <addressOffset>0x05</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>TX_SEL4</name>
              <description>PD send type selection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TX_SEL3</name>
              <description>PD send type selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TX_SEL2</name>
              <description>PD send type selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TX_SEL1</name>
              <description>PD send type selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
	       </fields>
		</register>
        <register>
          <name>R16_BMC_TX_SZ</name>
          <displayName>R16_BMC_TX_SZ</displayName>
          <description>Total length sent</description>
          <addressOffset>0x06</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>BMC_TX_SZ</name>
              <description>Total length sent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
	       </fields>
		</register>
        <register>
          <name>R8_DATA_BUF</name>
          <displayName>R8_DATA_BUF</displayName>
          <description>DMA buffer data register</description>
          <addressOffset>0x08</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>DATA_BUF</name>
              <description>DMA DATA_BUFFER</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
	       </fields>
		</register>
        <register>
          <name>R8_STATUS</name>
          <displayName>R8_STATUS</displayName>
          <description>PD interrupt flag register</description>
          <addressOffset>0x09</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IF_TX_END</name>
              <description>Transmission completed interrupt flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>IF_RX_RESET</name>
              <description>Receive reset interrupt flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>IF_RX_ACT</name>
              <description>Receive completed interrupt flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>IF_RX_BYTE</name>
              <description>Receive byte/SOP interrupt flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>IF_RX_BIT</name>
              <description>Receive BIT/5BIT interrupt flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>BUF_ERR</name>
              <description>BUFFER/DMA error interrupt flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>BMC_AUX</name>
              <description>Indicating the current state</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-only</access>
            </field>
	       </fields>
		</register>
        <register>
          <name>R16_BMC_BYTE_CNT</name>
          <displayName>R16_BMC_BYTE_CNT</displayName>
          <description>byte count register</description>
          <addressOffset>0x0A</addressOffset>
          <size>0x10</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>BMC_BYTE_CNT</name>
              <description>BMC_BYTE_CNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
	       </fields>
		</register>
        <register>
          <name>R16_PORT_CC1</name>
          <displayName>R16_PORT_CC1</displayName>
          <description>port control register</description>
          <addressOffset>0x0C</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <resetValue>0x0003</resetValue>
          <fields>
            <field>
              <name>CC1_CE</name>
              <description>Enable port voltage comparator</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CC1_LVE</name>
              <description>port output lower voltage enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC1_PU</name>
              <description>port pull-up current enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC1_PD</name>
              <description>port pull-down resistor enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA_CC1_AI</name>
              <description>port comparator simulates input</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
	       </fields>
		</register>
        <register>
          <name>R16_PORT_CC2</name>
          <displayName>R16_PORT_CC2</displayName>
          <description>port control register</description>
          <addressOffset>0x0E</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <resetValue>0x0003</resetValue>
          <fields>
            <field>
              <name>CC2_CE</name>
              <description>Enable port voltage comparator</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CC2_LVE</name>
              <description>port output lower voltage enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC2_PU</name>
              <description>port pull-up current enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC2_PD</name>
              <description>port pull-down resistor enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA_CC2_AI</name>
              <description>port comparator simulates input</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
	       </fields>
		</register>
        <register>
          <name>R16_DMA</name>
          <displayName>R16_DMA</displayName>
          <description>DMA cache start address register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>USBPD_DMA_ADDR</name>
              <description>USBPD_DMA cache address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
	       </fields>
		</register>
