Community-PIO-CH32V/platform-ch32v/misc/svd/CH32M103xx.svd
      </registers>
	</peripheral>
	<peripheral>
      <name>USBFS</name>
      <description>USB full speed host/equipment control register</description>
      <groupName>USBFS</groupName>
      <baseAddress>0x50000000</baseAddress>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>USBFS_WKUP</name>
        <description>USBFS wake-up interrupt</description>
        <value>60</value>
      </interrupt>
      <interrupt>
        <name>USBFS</name>
        <description>USBFS global interrupt</description>
        <value>59</value>
      </interrupt>
		<registers>
			<register>
				<name>USB_CTRL</name>
				<description>USB base control</description>
				<addressOffset>0x00</addressOffset>
				<size>0x08</size>
				<access>read-write</access>
        <resetValue>0x06</resetValue>
				<fields>
					<field>
						<name>RB_UC_DMA_EN</name>
						<description>DMA enable and DMA interrupt enable for USB</description>
						<bitRange>[0:0]</bitRange>		
					</field>
					<field>
						<name>RB_UC_CLR_ALL</name>
						<description>force clear FIFO and count of USB</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>RB_UC_RESET_SIE</name>
						<description>force reset USB SIE, need software clear</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_UC_INT_BUSY</name>
						<description>enable automatic responding busy for device mode or automatic pause for host mode during interrupt flag UIF_TRANSFER valid</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>MASK_UC_SYS_CTRL</name>
						<description>USB system control</description> 
						<bitRange>[4:4]</bitRange>
					</field>					
					<field>
						<name>MASK_UC_SYS_CTRL__RB_UC_DEV_PU_EN</name>
						<description>USB system control;USB control enable</description> 
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>RB_UC_LOW_SPEED</name>
						<description>USB bus signal transmission rate select bit</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_UC_HOST_MODE</name>
						<description>enable USB host mode: 0=device mode, 1=host mode</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>USB_INT_EN</name>
				<description>USB interrupt enable</description>
				<addressOffset>0x02</addressOffset>
				<size>0x08</size>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<fields>
					<field>
						<name>RB_UIE_BUS_RST__RB_UIE_DETECT</name>
						<description>enable interrupt for USB bus reset event for USB device mode;enable interrupt for USB device detected event for USB host mode</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RB_UIE_TRANSFER</name>
						<description>enable interrupt for USB transfer completion</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>RB_UIE_SUSPEND</name>
						<description>enable interrupt for USB suspend or resume event</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_UIE_HST_SOF</name>
						<description>in USB host mode, SOF is interrupt periodically</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_UIE_FIFO_OV</name>
						<description>enable interrupt for FIFO overflow</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_UID_1_WIRE</name>
						<description>USB single-line mode enable</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>RB_UIE_DEV_NAK</name>
						<description>enable interrupt for NAK responded for USB device mode</description>
						<bitRange>[6:6]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>USB_DEV_AD</name>
				<description>USB device address</description>
				<addressOffset>0x03</addressOffset>
				<size>0x08</size>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<fields>
					<field>
						<name>MASK_USB_ADDR</name>
						<description>bit mask for USB device address</description>
						<bitRange>[6:0]</bitRange>
					</field>
					<field>
						<name>RB_UDA_GP_BIT</name>
						<description>general purpose bit</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>USB_MIS_ST</name>
				<description>USB miscellaneous status register</description>
				<addressOffset>0x05</addressOffset>
				<size>0x08</size>
				<access>read-only</access>
				<resetValue>0x00</resetValue>
				<fields>
					<field>
						<name>RB_UMS_SOF_PRES</name>
						<description>SOF package indicates the status bit in USB host mode</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>RB_UMS_SOF_ACT</name>
						<description>SOF package transmission status bit in USB host mode</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_UMS_SIE_FREE</name>
						<description>IDLE state bit of the USB protocol processor</description>
						<bitRange>[5:5]</bitRange>
					</field>					
					<field>
						<name>RB_UMS_R_FIFO_RDY</name>
						<description>USB receives FIFO dataready status bit</description>
						<bitRange>[4:4]</bitRange>
					</field>					
					<field>
						<name>RB_UMS_BUS_RST</name>
						<description>USB bus reset status bit</description>
						<bitRange>[3:3]</bitRange>
					</field>					
					<field>
						<name>RB_UMS_SUSPEND</name>
						<description>USB hangs up status bits</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_UMS_DM_LEVEL</name>
						<description>judgment speed</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>RB_UMS_DEV_ATTACH</name>
						<description>port connection status</description>
						<bitRange>[0:0]</bitRange>
					</field>					
				</fields>
			</register>
			<register>
				<name>USB_INT_FG</name>
				<description>USB miscellaneous status register</description>
				<addressOffset>0x06</addressOffset>
				<size>0x08</size>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<fields>
					<field>
						<name>RB_U_IS_NAK</name>
						<description>SOF package indicates the status bit in USB host mode</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>RB_U_TOG_OK</name>
						<description>synchronization flag matches the status bits</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_U_SIE_FREE</name>
						<description>PID characteristic</description>
						<bitRange>[5:5]</bitRange>
					</field>					
					<field>
						<name>RB_UIF_FIFO_OV</name>
						<description>USB FIFO overflow interrupt flag</description>
						<bitRange>[4:4]</bitRange>
					</field>					
					<field>
						<name>RB_UIF_HST_SOF</name>
						<description>SOF timer interrupt flag in USB host mode</description>
						<bitRange>[3:3]</bitRange>
					</field>					
					<field>
						<name>RB_UIF_SUSPEND</name>
						<description>USB bus suspend or wake-up event interrupt flag</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_UIF_TRANSFER</name>
						<description>USB transfer completion interrupt flag</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>RB_UIF_DETECT__RB_UIF_BUS_RST</name>
						<description>interrupt flag bit</description>
						<bitRange>[0:0]</bitRange>
					</field>					
				</fields>
			</register>
			<register>
				<name>USB_INT_ST</name>
				<description>USB interrupt status register</description>
				<addressOffset>0x07</addressOffset>
				<size>0x08</size>
				<access>read-only</access>
				<resetValue>0x00</resetValue>
				<fields>
					<field>
						<name>RB_UIS_SETUP_ACT</name>
						<description>SETUP transaction is completed</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>RB_UIS_TOG_OK</name>
						<description>Match Status Bits</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>MASK_UIS_TOKEN</name>
						<description>In device mode, the token PID identifier of the current USB transfer transaction</description>
						<bitRange>[5:4]</bitRange>
					</field>								
					<field>
						<name>MASK_UIS_ENDP__MASK_UIS_H_RES</name>
						<description>device mode:the endpoint number of current USB transfer transaction ;
						host mode :PID identifier of the current USB transfer transaction</description>
						<bitRange>[3:0]</bitRange>
					</field>										
				</fields>
			</register>
			<register>
				<name>USB_RX_LEN</name>
				<description>USB miscellaneous status register</description>
				<addressOffset>0x08</addressOffset>
				<size>0x10</size>
				<access>read-only</access>
				<resetValue>0x00</resetValue>
				<fields>
					<field>
						<name>R16_USB_RX_LEN</name>
						<description>current number of data bytes received by the USB endpoint</description>
						<bitRange>[9:0]</bitRange>
					</field>									
				</fields>
			</register>
			<register>
				<name>UDEV_CTRL__R8_UHOST_CTRL</name>
				<description>USB host physical port control register;USB host physical port control register</description>
				<addressOffset>0x01</addressOffset>
				<size>0x08</size>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<fields>
					<field>
						<name>RB_UD_PD_DIS</name>
						<description>USB host port internal pull-down resistance control</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>RB_UD_DP_PIN</name>
						<description>current pin status</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>RB_UD_DM_PIN</name>
						<description>current pin status</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_UD_LOW_SPEED</name>
						<description>usb host port low-speed mode enable</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_UD_GP_BIT</name>
						<description>common flag bit</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>RB_UD_PORT_EN</name>
						<description>usb host port enable</description>
						<bitRange>[0:0]</bitRange>
					</field>				
				</fields>
			</register>
			<register>
				<name>R8_UEP4_1_MOD</name>
				<description>endpoint 4/1 mode</description>
				<addressOffset>0x0C</addressOffset>
				<size>0x08</size>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<fields>
					<field>
						<name>RB_UEP1_RX_EN</name>
						<description>enable USB endpoint 1 receiving (OUT)</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>RB_UEP1_TX_EN</name>
						<description>enable USB endpoint 1 transmittal (IN)</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_UEP1_BUF_MOD</name>
						<description>buffer mode of USB endpoint 1</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_UEP4_RX_EN</name>
						<description>enable USB endpoint 4 receiving (OUT)</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_UEP4_TX_EN</name>
						<description>enable USB endpoint 4 transmittal (IN)</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_UEP4_BUF_MOD</name>
						<description>buffer mode of USB endpoint 4</description>
						<bitRange>[0:0]</bitRange>
					</field>				
				</fields>
			</register>
			<register>
				<name>R8_UEP2_3_MOD__R8_UH_EP_MOD</name>
				<description>endpoint 2/3 mode;USB host endpoint mode control register</description>
				<addressOffset>0x0D</addressOffset>
				<size>0x08</size>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<fields>
					<field>
						<name>RB_UEP3_RX_EN</name>
						<description>enable USB endpoint 3 receiving (OUT)</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>RB_UEP3_TX_EN__RB_UH_EP_TX_EN</name>
						<description>enable USB endpoint 3 transmittal (IN);endpoint send enable</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_UEP3_BUF_MOD__RB_UH_DM_PIN</name>
						<description>buffer mode of USB endpoint 3;endpoint send the data buffer mode control</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_UEP2_RX_EN</name>
						<description>enable USB endpoint 2 receiving (OUT)</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_UEP2_TX_EN__RB_UH_LOW_SPEED</name>
						<description>enable USB endpoint 2 transmittal (IN);host endpoint receive enable</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_UEP2_BUF_MOD__RB_UH_PORT_EN</name>
						<description>buffer mode of USB endpoint 2;endpoint receive the data buffer mode control</description>
						<bitRange>[0:0]</bitRange>
					</field>				
				</fields>
			</register>
			<register>
				<name>R8_UEP5_6_MOD</name>
				<description>endpoint 5/6 mode</description>
				<addressOffset>0x0E</addressOffset>
				<size>0x08</size>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<fields>
					<field>
						<name>RB_UEP6_RX_EN</name>
						<description>enable USB endpoint 6 receiving (OUT)</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>RB_UEP6_TX_EN</name>
						<description>enable USB endpoint 6 transmittal (IN)</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_UEP6_BUF_MOD</name>
						<description>buffer mode of USB endpoint 6</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_UEP5_RX_EN</name>
						<description>enable USB endpoint 5 receiving (OUT)</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_UEP5_TX_EN</name>
						<description>enable USB endpoint 5 transmittal (IN)</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_UEP5_BUF_MOD</name>
						<description>buffer mode of USB endpoint 5</description>
						<bitRange>[0:0]</bitRange>
					</field>				
				</fields>
			</register>
			<register>
				<name>R8_UEP7_MOD</name>
				<description>endpoint 7 mode</description>
				<addressOffset>0x0F</addressOffset>
				<size>0x08</size>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<fields>
					<field>
						<name>RB_UEP7_RX_EN</name>
						<description>enable USB endpoint 7 receiving (OUT)</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_UEP7_TX_EN</name>
						<description>enable USB endpoint 7 transmittal (IN)</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_UEP7_BUF_MOD</name>
						<description>buffer mode of USB endpoint 7</description>
						<bitRange>[0:0]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R32_UEP0_DMA</name>
				<description>endpoint 0 DMA buffer address</description>
				<addressOffset>0x10</addressOffset>
				<size>0x20</size>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<fields>
					<field>
						<name>UEP0_DMA</name>
						<description>endpoint buffer start address</description>
						<bitRange>[14:0]</bitRange>
					</field>
				</fields>					
			</register>
			<register>
				<name>R32_UEP1_DMA</name>
				<description>endpoint 1 DMA buffer address</description>
				<addressOffset>0x14</addressOffset>
				<size>0x20</size>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<fields>
					<field>
						<name>UEP1_DMA</name>
						<description>endpoint buffer start address</description>
						<bitRange>[14:0]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R32_UEP2_DMA__R16_UH_RX_DMA</name>
				<description>endpoint 2 DMA buffer address</description>
				<addressOffset>0x18</addressOffset>
				<size>0x20</size>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<fields>
					<field>
						<name>UEP2_DMA__R16_UH_RX_DMA</name>
						<description>endpoint buffer start address</description>
						<bitRange>[15:0]</bitRange>
					</field>
				</fields>				
			</register>
			<register>
				<name>R32_UEP3_DMA__R16_UH_TX_DMA</name>
				<description>endpoint 3 DMA buffer address</description>
				<addressOffset>0x1C</addressOffset>
				<size>0x20</size>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<fields>
					<field>
						<name>UEP3_DMA__R16_UH_TX_DMA</name>
						<description>endpoint buffer start address</description>
						<bitRange>[15:0]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R32_UEP4_DMA</name>
				<description>endpoint 4 DMA buffer address</description>
				<addressOffset>0x20</addressOffset>
				<size>0x20</size>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<fields>
					<field>
						<name>UEP4_DMA</name>
						<description>endpoint buffer start address</description>
						<bitRange>[14:0]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R32_UEP5_DMA</name>
				<description>endpoint 5 DMA buffer address</description>
				<addressOffset>0x24</addressOffset>
				<size>0x20</size>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<fields>
					<field>
						<name>UEP5_DMA</name>
						<description>endpoint buffer start address</description>
						<bitRange>[14:0]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R32_UEP6_DMA</name>
				<description>endpoint 6 DMA buffer address</description>
				<addressOffset>0x28</addressOffset>
				<size>0x20</size>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<fields>
					<field>
						<name>UEP6_DMA</name>
						<description>endpoint buffer start address</description>
						<bitRange>[14:0]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R32_UEP7_DMA</name>
				<description>endpoint 7 DMA buffer address</description>
				<addressOffset>0x2C</addressOffset>
				<size>0x20</size>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<fields>
					<field>
						<name>UEP7_DMA</name>
						<description>endpoint buffer start address</description>
						<bitRange>[14:0]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R16_UEP0_T_LEN</name>
				<description>endpoint send length register</description>
				<addressOffset>0x30</addressOffset>
				<size>0x10</size>
				<access>read-write</access>
				<resetValue>0x0000</resetValue>
				<fields>
					<field>
						<name>R8_UEP0_T_LEN</name>
						<description>set USB endpoint send data bytes</description>
						<bitRange>[6:0]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R16_UEP1_T_LEN</name>
				<description>endpoint send length register</description>
				<addressOffset>0x34</addressOffset>
				<size>0x10</size>
				<access>read-write</access>
				<resetValue>0x0000</resetValue>
				<fields>
					<field>
						<name>R8_UEP1_T_LEN</name>
						<description>set USB endpoint send data bytes</description>
						<bitRange>[6:0]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R16_UEP2_T_LEN</name>
				<description>endpoint send length register</description>
				<addressOffset>0x38</addressOffset>
				<size>0x10</size>
				<access>read-write</access>
				<resetValue>0x0000</resetValue>
				<fields>
					<field>
						<name>HSOT_PID3__MASK_UH_TOKEN</name>
						<description>PID[3] in host mode;set the token PID packet flag </description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>R8_UEP1_T_LEN__MASK_UH_TOKEN</name>
						<description>set USB endpoint send data bytes;set the token PID packet flag</description>
						<bitRange>[6:4]</bitRange>
					</field>
					<field>
						<name>R8_UEP1_T_LEN__MASK_UH_ENDP</name>
						<description>set the endpoint number of the target device;
						set USB endpoint send data bytes</description>
						<bitRange>[3:0]</bitRange>
					</field>
				</fields>
			</register>
		<register>
				<name>R8_UH_RX_CTRL</name>
				<description>USB host receive endpoint control register</description>
				<addressOffset>0x3B</addressOffset>
				<size>0x08</size>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<fields>
					<field>
						<name>RB_UH_R_AUTO_TOG</name>
						<description>sync trigger bit aoto flip enable control</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_UH_R_TOG</name>
						<description>sync trigger bit expected by usb host receiver</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_UH_R_RES</name>
						<description>host receiver response control for IN transactions</description>
						<bitRange>[0:0]</bitRange>
					</field>					
				</fields>
			</register>
			<register>
				<name>R16_UEP3_T_LEN__R16_UH_TX_LEN</name>
				<description>endpoint send length register</description>
				<addressOffset>0x3C</addressOffset>
				<size>0x10</size>
				<access>read-write</access>
				<resetValue>0x0000</resetValue>
				<fields>
					<field>
						<name>R8_UH_TX_LEN</name>
						<description>set USB endpoint send data bytes</description>
						<bitRange>[15:10]</bitRange>
					</field>			
					<field>
						<name>R8_UEP3_T_LEN__R8_UH_TX_LEN</name>
						<description>set USB endpoint send data bytes</description>
						<bitRange>[9:0]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R16_UEP4_T_LEN</name>
				<description>endpoint send length register</description>
				<addressOffset>0x40</addressOffset>
				<size>0x10</size>
				<access>read-write</access>
				<resetValue>0x0000</resetValue>
				<fields>
					<field>
						<name>R8_UEP4_T_LEN</name>
						<description>set USB endpoint send data bytes</description>
						<bitRange>[6:0]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R16_UEP5_T_LEN</name>
				<description>endpoint send length register</description>
				<addressOffset>0x44</addressOffset>
				<size>0x10</size>
				<access>read-write</access>
				<resetValue>0x0000</resetValue>
				<fields>
					<field>
						<name>R8_UEP5_T_LEN</name>
						<description>set USB endpoint send data bytes</description>
						<bitRange>[6:0]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R16_UEP6_T_LEN</name>
				<description>endpoint send length register</description>
				<addressOffset>0x48</addressOffset>
				<size>0x10</size>
				<access>read-write</access>
				<resetValue>0x0000</resetValue>
				<fields>
					<field>
						<name>R8_UEP6_T_LEN</name>
						<description>set USB endpoint send data bytes</description>
						<bitRange>[6:0]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R16_UEP7_T_LEN</name>
				<description>endpoint send length register</description>
				<addressOffset>0x4C</addressOffset>
				<size>0x10</size>
				<access>read-write</access>
				<resetValue>0x0000</resetValue>
				<fields>
					<field>
						<name>R8_UEP7_T_LEN</name>
						<description>set USB endpoint send data bytes</description>
						<bitRange>[6:0]</bitRange>
					</field>
				</fields>
			</register>
