Community-PIO-CH32V/platform-ch32v/misc/svd/CH32M103xx.svd
			</registers>
	</peripheral>
    <peripheral>
      <name>ESIG</name>
      <description> ESIG configuration</description>
      <groupName>ESIG</groupName>
      <baseAddress>0x1FFFF7E0</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x200</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>FLACAP</name>
          <displayName>FLACAP</displayName>
          <description>Flash capecity register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x10</size>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>F_SIZE</name>
              <description>F_SIZE/kByte</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UNIID1</name>
          <displayName>UNIID1</displayName>
          <description>UID register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>U_ID</name>
              <description>U_ID value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>UNIID2</name>
          <displayName>UNIID2</displayName>
          <description>UID register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>U_ID</name>
              <description>U_ID value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>UNIID3</name>
          <displayName>UNIID3</displayName>
          <description>Div register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AWU_APR</name>
              <description>AWU_APR value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
	</peripherals>
 </device>
